#include "help_browser.h"
#include "ui_help_browser.h"
#include <QWebEngineView>
#include <QHBoxLayout>

help_browser::help_browser(QWidget *parent) :
    QDialog(parent),
    ui(new Ui::help_browser)
{
    ui->setupUi(this);
    QHBoxLayout *hlayout = new QHBoxLayout(this);
    QWebEngineView *view = new QWebEngineView(this);
    view->setHtml("<!DOCTYPE html>"
"<html>"
"<head>"
"	<title>Допомога</title>"
"	<style type=\"text/css\">"
"		body{"
"			width:500px;"
"			margin: auto;"
"		}"
"		h1,h3,p,img{"
"			margin: auto;"
"			text-align: center;"
"		}"
"	</style>"
"</head>"
"<body>"
"	<h1>Посібник користувача</h1>"
"	<h3>Структура програми:</h3>"
"        <p><img src=\"qrc:///help/crossword11.png\"></p>"
"	<p><b>1 - варіант введення слів</b><br>Є два варіанти введення: введення вручну та введення із вбудованого словника"
"		<br><b>2 - варіант генерування кросворду</b><br>Є два варіанти генерування: відразу цілий кросворд та покрокове генерування</p>"
"        <p><img src=\"qrc:///help/crossword12.png\"></p>"
"	<p><b>3 - кнопка очищення</b><br>Виконує очищення робочої області та видаляє усі внесені в базу слова<br>"
"		<b>4 - кнопка початку генерування</b><br>Виконує операцію генерування(для цього вже повинні бути введені слова)<br><b>5 - кнопка перенесення згенерованого кросворду у документ з форматом PDF</b><br>Переносить згенерований кросворд у документ з розширенням .pdf для подальшого друку. Документ буде знаходитись у папці з самою програмою під назвою NewCrossword.pdf </p>"
"        <p><img src=\"qrc:///help/crossword13.png\"></p>"
"	<p>6 - область де буде відображений згенерований кросворд<br>"
"		7 - список слів які внесені в базу<br>"
"	8 - список не використаних із бази слів при останній генерації</p><hr>"
"	<h3>Для створення кросворду виконайте наступні дії:</h3>"
"	<br>"
"	<p><b>Крок 1</b> - виберіть чи використовувати слова зі вбудованого словника або введіть їх самі для цього виберіть кнопку відповідного варіанту введення <b>1</b> або <b>2</b>.</p><br>"
"	<p><b>Крок 2</b> - якщо ви вибрали варіант самостійного введення: </p>"
"        <p><img src=\"qrc:///help/vved.png\"></p>"
"	<p>Слово яке потрібно відгадати запишіть у поле <b>1</b><br>"
"		Запитання для цього слова запишіть у поле <b>2</b><br>"
"		Щоб додати слово у базу натисніть кнопку <b>4(Додати)</b><br>"
"		Якщо хочете внести це слово також у словник поставте галочку у полі <b>3</b><br>"
"		Коли усі слова уже внесені або ви хочете вибрати інший режим натисніть кнопку <b>5(Закрити)</b></p><br>"
"	<p><b>Крок 2</b> - якщо ви вибрали варіант введення слів із вбудованого словника: </p>"
"        <p><img src=\"qrc:///help/slovnuk.png\"></p>"
"	<p>У поле <b>1</b> введіть потрібну кількість слів<br>"
"		Для підтвердження натисніть кнопку <b>2(Підтвердити)</b><br>"
"		Для виходу натисніть кнопку <b>3(Закрити)</b></p><br>"
"	<p><b>Крок 3</b> - натисніть кнопку згенерувати на головному вікні і згенерований кросворд відобразиться у відповідній області</p>"
                  "</body>"
                  "</html>");
    view->show();
    hlayout->addWidget(view);
    setLayout(hlayout);
    this->setMinimumWidth(600);
    this->setMinimumHeight(400);
}

help_browser::~help_browser()
{
    delete ui;
}
